
do

function run(msg, matches)
local reply_id = msg['id']
local S = [[ 

	  ✔️تعمل جميع الاوامر بدون وضع / او !
ا🔸➖🔹➖🔸➖🔹➖🔸

 ❣ زخرفه : خاصيه  زخرفه الاسماء
         يمكن زخرفه الاسماء بارسال زخرف 
		       يلها الاسم للعربيه
         وللانكليزيه زخرفه يليها الاسم

 ❣ معلوماتي : عرض معلوماتك في الكروب
   
 ❣ الاذان : اظهار مواقيت الاذان
 
 ❣ رتبتي : اظهار رتبتك داخل الكروب
 
 ❣ صوت : الكلمة المراد نطقها
        صوت   [يدعم الانلكش فقط]

 ❣ صوره : الكلمه المراد تحويلها صوره
        صوره   [يدعم الانلكش فقط]
       					
 ❣ خريطه : لجلب الخرائط
         مثال : خريطه العراق
		
 ❣ انستا : اليوزر لمعرفه معلومات الانستا

 ❣ ملصق : قم بارسال صورة
        وقم بلرد عليها بكلمة لجعله ملصق

 ❣ صوره : قم بارسال ملصق
        وقم بالرد عليه لجعلها 
		
ا🔸➖🔹➖🔸➖🔹➖🔸	
	

 ]]
reply_msg(reply_id, S, ok_cb, false)
end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م2)$",
},
run = run 
}
end
