do

function run(msg, matches)
  return [[ 

✔️تعمل جميع الاوامر بدون وضع / او !
ا🔸➖🔹➖🔸➖🔹➖🔸

❣ م1  : لعرض الاوامر الريئسيه
      [اوامر الاداريين والادمنيه فقط]

❣ م2  :لعرض الاوامر الثانويه
      [يمكن استخدامها من قبل العضو]

❣ م المطور : لعرض اوامر المطور
      [خاصه بمطور البوت]

❣ مطور البوت : لعرض معلومات المطور
      [يمكن لاي شخص الاطلاع عليها]

❣ تحديثات البوت : لعرض اخر التحديثات المضافه
      [يمكن لاي شخص الاطلاع عليها]

ا🔸➖🔹➖🔸➖🔹➖🔸

]]


end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(اوامر البوت)$",
},
run = run 
}
end
