-- made by { @Mouamle }
do
ws = {}
rs = {}

-- some examples of how to use this :3 
ws[1] = "السلام عليكم" -- msg 
rs[1] =  "وعليكم السلام ورحمة الله هلا اغاتي" -- reply 

ws[2] = "بوسني" -- msg 
rs[2] =  "مووواح فدوه لربك❤️🙈" -- reply 

ws[3] = "بوت" -- msg 
rs[3] =  "ها حياتي اكتب اوامر البوت وأمرني 😻❤️" -- reply 
	
ws[4] = "حسن البغدادي" -- msg 
rs[4] = "هذا الي صنعني فديت ربه 🙈❤️" -- reply 

ws[5] = "شلونكم" -- msg 
rs[5] = " تمام حياتي وانت شلونك😍❤️" -- reply 

ws[6] = "ضوجه" -- msg 
rs[6] = "شي اكيد الكبل ماكو 😂 لو بعدك/ج مازاحف/ة 🙊😋" --reply 

ws[7] = "زاحف" -- msg 
rs[7] = "زاحف على خالتك/ج الشكره️😝😂🙌" 

ws[8] = "احبك" -- msg 
rs[8] ="اووف فدوه اروحلك انا امواح 🙈❤️" 

ws[9] = "انجب" -- msg 
rs[9] =" صار اغاتي انجبيت😷💛️" -- 

ws[10] = "تحبني" -- msg 
rs[10] =" شعندي غيرك/ج يبعد رويحتي😻❤️️" -- 

ws[11] = "منو صنعك" -- msg 
rs[11] ="اني سويت نفسي شنو مو كدها -_-️️" -- 

ws[12] = "باي" -- msg 
rs[12] ="بايات حياتي انته الله وياك👋😽️" 

ws[13] = "اريد بوت حماية" -- msg 
rs[13] =" راسلني هنا @HASSAN_IRQ❤️😍️" 

ws[14] = "هلو" -- msg 
rs[14] ="هلوات على النبي😹" 

ws[15] ="دي" -- msg 
rs[15] ="ديييييات" 

ws[16] = "شكد" -- msg 
rs[16] ="اكثر من ما تتصور😍😍❤️️" 

ws[17] = "اريد اكبل" -- msg 
rs[17] =" خخ اني هم اريد اكبل قابل ربي وحد😹🙌️" 

ws[18] = "اتفل" -- msg 
rs[18] ="ختفوووووووووو💦💦️️" 

ws[19] = "شلونك" -- msg 
rs[19] ="تمام حبي وانت/ي شلونك😍😍😍️️"

ws[21] ="البوت واكف" -- msg 
rs[21] ="دافع الاشتراك 3$" 

ws[22] ="كول والله" -- msg 
rs[22] ="واللهتين" 

ws[23] = "تخليني" -- msg 
rs[23] ="ادبسز عيب منا عالم تعال وره ال 12 كلها نايمه😉️️" 

ws[24] ="كروب دعم" -- msg 
rs[24] ="دعمتك تريله كول امين" 

ws[25] = "اكرهك" -- msg 
rs[25] ="موووواح شلون بوسه عسل والله عسل افيش 😍❤️️" 

ws[26] = "شكو ماكو" -- msg 
rs[26] ="غيرك/ج بل كلب ماكو يبعد كلبي😍❤️️" 

ws[27] = "اكلك" -- msg 
rs[27] ="كول يعمري😍❤️️" 

ws[28] = "حسين البغدادي" -- msg 
rs[28] ="كول يعمري😍❤️️" 

ws[29] = "مرحبا" -- msg 
rs[29] ="مراحب عيوني كل الهلا 😍❤" 

ws[30] = "فدوه" -- msg 
rs[30] ="فداك الكون يكلبي 😍❤" 

ws[31] = "بغداد" -- msg 
rs[31] ="فديت بغداد والي بيها 😍❤"

ws[32] = "فوديتك" -- msg 
rs[32] ="فداك الكون واولهم اني 😍❤"

ws[33] = "فديتك" -- msg 
rs[33] ="فداك الكون واولهم اني 😍❤"

ws[34] = "دوم" -- msg 
rs[34] ="دوم وجيري 😂😂 اضحك شبيك نفسيه 😒"

ws[35] = "دووم" -- msg 
rs[35] ="دوم وجيري 😂😂 اضحك شبيك نفسيه 😒"

ws[36] = "دوووم" -- msg 
rs[36] ="دوم وجيري 😂😂 اضحك شبيك نفسيه 😒"

ws[37] = "دووووم" -- msg 
rs[37] ="دوم وجيري 😂😂 اضحك شبيك نفسيه 😒"

ws[38] = "😂" -- msg 
rs[38] ="ضم سنونك لا تمشك 😒"

ws[39] = "😂😂" -- msg 
rs[39] ="ضم سنونك لا تمشك 😒"

ws[40] = "😒😒" -- msg 
rs[40] ="لا تباوع صفح لا افلش فجك 😒"

ws[41] = "😒" -- msg 
rs[41] ="لا تباوع صفح لا افلش فجك 😒"

ws[42] = "ولله" -- msg 
rs[42] ="مصدكك لا تحلف ادري بيك جذاب 😂"

ws[43] = "والله" -- msg 
rs[43] ="مصدكك لا تحلف ادري بيك جذاب 😂"

ws[44] = "والله العظيم" -- msg 
rs[44] ="مصدكك لا تحلف ادري بيك جذاب 😂"

ws[45] = "ولله شبيك" -- msg 
rs[45] ="مصدكك لا تحلف ادري بيك جذاب 😂"

ws[46] = "والله شبيك" -- msg 
rs[46] ="مصدكك لا تحلف ادري بيك جذاب 😂"

ws[47] = "اصنام" -- msg 
rs[47] ="هدني عليهم وعيونك اسحلهم سحل 😡"

ws[48] = "منو انت" -- msg 
rs[48] ="ولك متعرفني اني البوت الخيل والليل والبيداء تعرفني 😂"

ws[49] = "منو انته" -- msg 
rs[49] ="ولك متعرفني اني البوت الخيل والليل والبيداء تعرفني 😂"

ws[50] = "ولج" -- msg 
rs[50] ="ها ما بينه هيج ميانه 😒"

ws[51] = "ولك" -- msg 
rs[51] ="ها ما بينه هيج ميانه 😒"

ws[52] = "ضلعي" -- msg 
rs[52] ="لك والنعم منك يالضلع الما ينشلع ️😍❤️"

ws[53] = "ضلعتي" -- msg 
rs[53] ="لك والنعم منك يالضلع الما ينشلع ️😍❤️"

ws[54] = "جكمه" -- msg 
rs[54] ="جكمه بعينك 😒 دشوفها مو جنها غزاله ️😍❤️"

ws[55] = "جكمة" -- msg 
rs[55] ="جكمه بعينك 😒 دشوفها مو جنها غزاله ️😍❤️"

ws[56] = "هلاو" -- msg 
rs[56] ="هلا ولله فديت هل طله اني نور الكروب ️😍❤️"

ws[57] = "هلاوو" -- msg 
rs[57] ="هلا ولله فديت هل طله اني نور الكروب ️😍❤️"

ws[58] = "صدوك" -- msg 
rs[58] ="وداعت جهالي مامجذب 😢"

ws[59] = "صدك" -- msg 
rs[59] ="وداعت جهالي مامجذب 😢"

ws[60] = "اسكت معليك" -- msg 
rs[60] ="هيج احسن الك ترزلت 😂😁"

ws[61] = "اسكت" -- msg 
rs[61] ="هيج احسن الك ترزلت 😂😁"

ws[62] = "معليك انت" -- msg 
rs[62] ="هيج احسن الك ترزلت 😂😁"

ws[63] = "معليك انت لا تدخل" -- msg 
rs[63] ="هيج احسن الك ترزلت 😂😁"

ws[64] = "معليك" -- msg 
rs[64] ="هيج احسن الك ترزلت 😂😁"

ws[65] = "انت تحبني" -- msg 
rs[65] ="لك مو بس احبك اخرب عليك يروحي 😍❤️"

ws[66] = "انته تحبني" -- msg 
rs[66] ="لك مو بس احبك اخرب عليك يروحي 😍❤️"

ws[67] = "انتة تحبني" -- msg 
rs[67] ="لك مو بس احبك اخرب عليك يروحي 😍❤️"

-- the main function
function run( msg, matches )
	-- just a local variables that i used in my algorithm  
	local i = 0; local w = false

	-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
	-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
	for k,v in pairs(ws) do
		-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
		if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
			-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
			i = k; w = true;
		end
	end

	-- check if { w } is not false and { i } not equals to 0
	if ( (w ~= false) and (i ~= 0) ) then
		-- get the receiver :3 
		R = get_receiver(msg)
		-- send him the proper message from the index that { i } assigned to
		--send_large_msg ( R , rs[i] );
		--send_reply(msg.id, rs[i])
		reply_msg(msg.id, rs[i], ok_cb, false )
	end
	
	-- don't edit this section
	if ( msg.text == "about" ) then
		if ( msg.from.username == "Mouamle" ) then
			R = get_receiver(msg)
			send_large_msg ( R , "Made by @Mouamle" );
		end
	end 

end



return {
	patterns = {
		"(.*)"		
  	},
  	run = run
} 


end